tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "romkatv/gitstatus"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
brew "autojump"
brew "bat"
brew "expect"
brew "eza"
brew "fd"
brew "ffmpegthumbnailer"
brew "fzf"
brew "forgit"
brew "gh"
brew "git-delta"
brew "htop"
brew "httpie"
brew "jq"
brew "lazygit"
brew "m-cli"
brew "maven"
brew "mdcat"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "node"
brew "openjdk@17"
brew "poppler"
brew "ripgrep"
brew "rustup-init"
brew "tmux"
brew "tmuxinator"
brew "translate-shell"
brew "tree"
brew "unar"
brew "yazi", args: ["HEAD"]
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "romkatv/gitstatus/gitstatus"
cask "font-hack-nerd-font"
cask "font-sf-mono-nerd-font-ligaturized"
cask "iterm2-beta"
cask "wechat"
cask "google-chrome"
cask "amethyst"
cask "karabiner-elements"
cask "maccy"
cask "qlmarkdown"
cask "syntax-highlight"
cask "iina"
cask "iina-plus"
cask "sublime-text"
cask "intellij-idea"
cask "docker"
cask "picgo"
